##### homepage: http://pandas.pydata.org/index.html

In [ ]:
# 2019-10-30

# Indexing and Selecting Data

In [8]:
# https://pandas.pydata.org/pandas-docs/stable/indexing.html
# https://www.oreilly.com/learning/introducing-pandas-objects

In [1]:
import pandas as pd
import warnings
import numpy as np
import matplotlib.pyplot as plt
warnings.filterwarnings("ignore")

# df1 = pd.read_csv("./trainset/pcdata_0611.csv") 
# read_sql read_html

In [ ]:
#

# read_csv set dtype
pandas auto set int-like value to type=Int, this can cause some problems when a column is expected to be type=str.
So explicitly define the dtype is recommended. 
And you have to make sure the columns name specified is the same with the one in the csv file. Be aware that its case sensitive.

In [36]:
df = pd.read_csv('data_morning_start_style.csv', dtype={"STOCK_CODE": str})

### Slice TOP 10

In [41]:
df.sort_values('raw_X',ascending=False)[:10]

      SECURITY_ID_INT       raw_X       raw_Y vertical horizontal
1944            75305  600.291868   72.589333    small     growth
3088           256836  587.409832  140.974201      mid     growth
1943            41696  581.950116   46.692474    small     growth
3087              143  581.630188  116.999930      mid     growth
1942            75287  580.319624   94.700635    small     growth
1941            40082  576.016574   90.866245    small     growth
1940            75273  574.908970   56.572737    small     growth
1939            74714  571.743860   95.194420    small     growth
3086            74677  563.843994  129.392789      mid     growth
1938            75323  560.260334   53.510382    small     growth

# Creating DataFrame

In [2]:
import pandas as pd

In [3]:
style = pd.read_csv('data_morning_start_style.csv')
style.head()

   SECURITY_ID_INT       raw_X       raw_Y vertical horizontal
0             1734 -106.512730  223.595615    large      value
1             1351  -95.753155  244.328818    large      value
2             2228  -74.231371  318.054976    large      value
3             2296  -57.797931  394.503697    large      value
4             1971  -50.873616  581.970420    large      value

In [3]:
index = style.vertical=='large'

In [5]:
style.loc[index, 'bool'] = True

In [6]:
style.head()

   SECURITY_ID_INT       raw_X       raw_Y vertical horizontal  bool
0             1734 -106.512730  223.595615    large      value  True
1             1351  -95.753155  244.328818    large      value  True
2             2228  -74.231371  318.054976    large      value  True
3             2296  -57.797931  394.503697    large      value  True
4             1971  -50.873616  581.970420    large      value  True

In [7]:
style.tail()

      SECURITY_ID_INT       raw_X       raw_Y vertical horizontal bool
3084            75293  535.366920  169.049964      mid     growth  NaN
3085           460689  543.062896  134.359182      mid     growth  NaN
3086            74677  563.843994  129.392789      mid     growth  NaN
3087              143  581.630188  116.999930      mid     growth  NaN
3088           256836  587.409832  140.974201      mid     growth  NaN

### quantile

In [11]:
df =pd.DataFrame([10,8,6,4,2])
df=df.astype(int)

In [14]:
df.rolling(3).sum()

      0
0   NaN
1   NaN
2  24.0
3  18.0
4  12.0

In [6]:
df =pd.DataFrame([10,18,24,28,30])

In [7]:
df.quantile(0.9)

0    29.2
Name: 0.9, dtype: float64

In [4]:
style['raw_X'].quantile(0.5)

163.457773479

In [6]:
style['raw_X'].quantile(0.9)

332.1384173490001

In [8]:
style['raw_X'].quantile(0.3)

104.29030494079998

In [5]:
style.describe()

       SECURITY_ID_INT        raw_X        raw_Y
count     3.089000e+03  3089.000000  3089.000000
mean      1.870488e+05   166.329623   128.246714
std       2.283976e+06   131.718915    90.627564
min       2.000000e+00  -275.302198   -66.794896
25%       9.480000e+02    84.797665    62.353701
50%       2.434000e+03   163.457773   110.661913
75%       4.074000e+03   241.166778   174.223061
max       3.001188e+07   600.291868   640.353763

In [4]:
style.describe()
style.vertical.unique()

array(['large', 'mid', 'small'], dtype=object)

In [6]:
mapkey = {'large':1,'mid':2,'small':3}

In [9]:
style['map'] = style.vertical.map(mapkey)

In [72]:
style.head()

   SECURITY_ID_INT       raw_X       raw_Y vertical horizontal  map
0             1734  100.000000  223.595615      NaN      value    1
1             1351  -95.753155  244.328818    large      value    1
2             2228  -74.231371  318.054976    large      value    1
3             2296  -57.797931  394.503697    large      value    1
4             1971  -50.873616  581.970420    large      value    1

In [24]:
style.loc[0, 'vertical'] = np.nan

# about how to fillna with the mean of a given group

In [19]:
# style.groupby('vertical').apply(lambda x: x.fillna(x.mean()))

### https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

In [36]:
# style.isnull().any(axis=1)
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                   columns=list('ABCD'))

In [37]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [38]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [39]:
values = {'A': 0}
df.fillna(value=values)

     A    B   C  D
0  0.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  0.0  NaN NaN  5
3  0.0  3.0 NaN  4

In [40]:
df.fillna(method='ffill')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

# to get index of rows with NAN

In [56]:
idx = style[style.vertical.isnull()].index

In [57]:
idx

Int64Index([0], dtype='int64')

In [62]:
style.loc[idx,'raw_X'] = 100

# to get how many NAN in each group

In [5]:
df = style.groupby('horizontal')['vertical'].apply(lambda x: x.isnull().sum())#.to_dict()
type(df)
df

horizontal
core      0
growth    0
value     0
Name: vertical, dtype: int64

In [10]:
style.head()

   SECURITY_ID_INT       raw_X       raw_Y vertical horizontal
0             1734 -106.512730  223.595615    large      value
1             1351  -95.753155  244.328818    large      value
2             2228  -74.231371  318.054976    large      value
3             2296  -57.797931  394.503697    large      value
4             1971  -50.873616  581.970420    large      value

In [11]:
df = style.groupby('horizontal').apply(lambda x: x.fillna(x['horizontal']))#.to_dict()
# df[df.SECURITY_ID_INT==1734]
# df

# fillna with mean() of each group

In [18]:
import numpy as np
style.loc[0,'raw_X'] = np.nan
style.loc[3088,'raw_X'] = np.nan

style.head()
# style.groupby('vertical').apply(lambda x: x.fillna(x.mean()))

   SECURITY_ID_INT      raw_X       raw_Y vertical horizontal
0             1734        NaN  223.595615    large      value
1             1351 -95.753155  244.328818    large      value
2             2228 -74.231371  318.054976    large      value
3             2296 -57.797931  394.503697    large      value
4             1971 -50.873616  581.970420    large      value

In [23]:
style.shape

(3089, 5)

In [15]:
style.groupby('vertical').mean()

          SECURITY_ID_INT       raw_X       raw_Y
vertical
large       110475.104056  201.485094  276.059847
mid          32942.641921  154.432431  142.928277
small       346721.206972  161.970242   55.174502

In [21]:
# style.loc[0,'raw_X'] will be the mean of group(vertical=='large')
df = style.groupby('vertical').apply(lambda x: x.fillna(x.mean()['raw_X']))
df.shape

(3089, 5)

In [40]:
# style['vertical'].values
style.vertical.values

array([nan, 'large', 'large', ..., 'mid', 'mid', 'mid'], dtype=object)

In [31]:
# np.isnan(style)#.all()
style.isnull()
s = style['raw_X'].isnull()
type(s)
# np.isnan(df['eps' + '_err'].values).all()

pandas.core.series.Series

In [33]:
style[style.raw_X.isnull()]

      SECURITY_ID_INT  raw_X       raw_Y vertical horizontal
0                1734    NaN  223.595615    large      value
3088           256836    NaN  140.974201      mid     growth

# note! the difference between .loc[key] vs .loc[[key]]

In [4]:
style.set_index("SECURITY_ID_INT").loc[1734]

raw_X        -106.513
raw_Y         223.596
vertical        large
horizontal      value
Name: 1734, dtype: object

In [6]:
style.set_index("SECURITY_ID_INT").loc[[1734]]

                     raw_X       raw_Y vertical horizontal
SECURITY_ID_INT
1734            -106.51273  223.595615    large      value

In [28]:
style.info()
# style

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3089 entries, 0 to 3088
Data columns (total 6 columns):
SECURITY_ID_INT    3089 non-null int64
raw_X              3089 non-null float64
raw_Y              3089 non-null float64
vertical           3089 non-null object
horizontal         3089 non-null object
a                  3089 non-null float64
dtypes: float64(3), int64(1), object(2)
memory usage: 144.9+ KB

### loop
https://engineering.upside.com/a-beginners-guide-to-optimizing-pandas-code-for-speed-c09ef2c6a4d6

In [7]:
%timeit
for k,v in style.iterrows():
    
#     print v

In [26]:
%lprun 3**2

UsageError: Line magic function `%lprun` not found.

In [25]:
# apply()
def fa(row):
    x = row[0]
    y = row[1]
    return x+y
#     return x**2 + y**2

%timeit style['a'] = style[['raw_X', 'raw_Y']].apply(fa, axis=1)

10 loops, best of 3: 93.3 ms per loop

In [44]:
# apply()

%timeit style['c'] = style[['raw_X', 'raw_Y']].apply(lambda x: x['raw_X']+ x['raw_Y'], axis=1)

10 loops, best of 3: 74.1 ms per loop

In [1]:
style.head()

NameError: name 'style' is not defined

### drop_duplicates()

In [2]:
pd.__version__

u'0.24.0'

In [3]:
df = pd.DataFrame([["mery", 2, np.nan, 0],
                  ["mery", 4, np.nan, 1],
                    ["lily", np.nan, np.nan, 5],
                    ["lily", 3, np.nan, 4]],
                   columns=list('ABCD'))

In [9]:
df.sort_values('A', ascending=True)

      A    B   C  D
2  lily  NaN NaN  5
3  lily  3.0 NaN  4
0  mery  2.0 NaN  0
1  mery  4.0 NaN  1

##### drop_duplicates keep='last'last
    keep : {first, last, False}, default first
    first : Drop duplicates except for the first occurrence.
    last : Drop duplicates except for the last occurrence.
    False : Drop all duplicates.

In [4]:
df.sort_values('A', ascending=True).drop_duplicates(['A'], keep='last')

      A    B   C  D
3  lily  3.0 NaN  4
1  mery  4.0 NaN  1

In [5]:
df.sort_values('A', ascending=True).drop_duplicates(['A'], keep='first')

      A    B   C  D
2  lily  NaN NaN  5
0  mery  2.0 NaN  0

##### keep : {first, last, False}, default first
    first : Mark duplicates as True except for the first occurrence.
    last : Mark duplicates as True except for the last occurrence.
    False : Mark all duplicates as True.

In [7]:
df.sort_values('A', ascending=True).duplicated(['A'], keep='first')

2    False
3     True
0    False
1     True
dtype: bool

In [8]:
df[df.sort_values('A', ascending=True).duplicated(['A'], keep='first')]

      A    B   C  D
1  mery  4.0 NaN  1
3  lily  3.0 NaN  4

In [6]:
df.duplicated("A", keep='first')

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
df = pd.DataFrame([["mery", 2, np.nan, 0],
                  ["mery", 4, np.nan, 1],
                    ["lily", np.nan, np.nan, 5],
                    ["lily", 5, np.nan, 5],
                    ["lily", 3, np.nan, 4]],
                   columns=list('ABCD'))

In [13]:
df.sort_values('A', ascending=True).drop_duplicates(['A'], keep='first')

      A    B   C  D
2  lily  NaN NaN  5
0  mery  2.0 NaN  0

In [12]:
df[df.sort_values('A', ascending=True).duplicated(['A'], keep='first')]

      A    B   C  D
1  mery  4.0 NaN  1
3  lily  5.0 NaN  5
4  lily  3.0 NaN  4

### Vectorization 
https://datascience.blog.wzb.eu/2018/02/02/vectorization-and-parallelization-in-python-with-numpy-and-pandas/

In [39]:
%timeit  style['b'] = np.power(style['raw_X'], 2)  + np.power(style['raw_Y'],2)

1000 loops, best of 3: 944 s per loop

In [38]:
# np.sqrt(style['raw_X']) + np.sqrt(style['raw_Y'])

In [41]:
# style

In [3]:
# SECURITY_ID_INT
style.drop_duplicates(['SECURITY_ID_INT'], inplace=True)

In [7]:
# SECURITY_ID_INT=1971vertical

large <type 'str'>

### 1

In [ ]:
var = style.set_index('SECURITY_ID_INT').loc[1734, 'vertical']
t = type(style.set_index('SECURITY_ID_INT').loc[1734, 'vertical'])
print var, t

### 2

In [8]:
var = style.loc[style['SECURITY_ID_INT']==1734, 'vertical']
t = type(style.loc[style['SECURITY_ID_INT']==1734, 'vertical'])
print var, t

0    large
Name: vertical, dtype: object <class 'pandas.core.series.Series'>

### 3

In [9]:
var = style.ix[1734]
t = type(style.ix[1734])
print var, t

SECURITY_ID_INT        160
raw_X              300.288
raw_Y              63.1416
vertical             small
horizontal          growth
Name: 1734, dtype: object <class 'pandas.core.series.Series'>

In [ ]:

#  https://blog.csdn.net/qq_34739497/article/details/79600479

# datetime

In [95]:
import pandas as pd

In [18]:
# https://stackoverflow.com/questions/16176996/keep-only-date-part-when-using-pandas-to-datetime
# fiscal_pre['publish_date'] = fiscal_pre['publish_date'].dt.date

In [96]:
datelist = pd.date_range("2019-01-01", "2019-01-05")
# datelist.reset_index()

In [97]:
datelist = pd.DataFrame(pd.date_range("2019-01-01", "2019-01-05"), columns=["date"])
# datelist.reset_index()

In [98]:
datelist.head()

        date
0 2019-01-01
1 2019-01-02
2 2019-01-03
3 2019-01-04
4 2019-01-05

In [99]:
datelist['date'] = datelist['date'].dt.date

In [105]:
# TODO change the time format
datelist["date"]=pd.to_datetime(datelist["date"])
datelist['date'] = datelist['date'].dt.strftime('%Y%m%d')#.info()

In [106]:
datelist[datelist.date=='20190102']#.info()

       date
1  20190102

In [23]:
df=pd.DataFrame([1568678400000],columns=['d'])

In [25]:
df['d']=pd.to_datetime(df['d'])

In [26]:
df

                           d
0 1970-01-01 00:26:08.678400

In [109]:
datelist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
date    5 non-null object
dtypes: object(1)
memory usage: 112.0+ bytes

In [121]:
pd.to_datetime(datelist["date"]).to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
date    5 non-null datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 112.0 bytes

In [122]:

# result.loc[:, 'tdate'] = pd.to_datetime(result['tdate'])
# result.loc[:, 'tdate'] = result['tdate'].dt.strftime('%Y%m%d')
df = pd.to_datetime(datelist["date"]).to_frame()
df
type(df)

pandas.core.frame.DataFrame

### timestamp 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html
convert timestamp to datetime

### 
floatint

In [ ]:
curday['processTime'] = curday['processTime'].astype(int)
curday['processTime'] = curday['processTime'].apply(lambda x: pd.Timestamp(x, unit='s'))

### .astype

In [123]:
df["date"] = df["date"].astype(str)

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
date    5 non-null object
dtypes: object(1)
memory usage: 112.0+ bytes

In [126]:
df[df.date=='2019-01-01']

         date
0  2019-01-01

In [26]:
datelist.astype(str)

         date
0  2019-01-01
1  2019-01-02
2  2019-01-03
3  2019-01-04
4  2019-01-05

### or

In [7]:
pd.to_datetime('2019-01-01').date()

datetime.date(2019, 1, 1)

In [4]:
pd.to_datetime(pd.datetime.today().date())

Timestamp('2019-03-08 00:00:00')

In [5]:
pd.to_datetime('2019-02-28')

Timestamp('2019-02-28 00:00:00')

In [ ]:
df_trade_cal = df_trade_cal[df_trade_cal["TRADE_DATE"]>=pd.to_datetime('2013').date()]

### Return a fixed frequency DatetimeIndex.
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html

In [15]:

# dates = pd.date_range('1/1/2000', periods=8)
# dates

pd.date_range(start='2019-01-01', end='2019-03-01')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01',
               '2019-02-02', '2019-02-03', '2019-02-04', '2019-02-05',
               '2019-02-06', '2019-02-07', '2019-02-08', '2019-02-09',
               '2019-02-10', '2019-02-11', '2019-02-12', '2019-02-13',
               '2019-02-14', '2019-02-15', '2019-02-16', '2019-02-17',
               '2019-02-18', '2019-02-19', '2019-02-20', '2019-02-21',
               '2019-02-22', '2019-02-23', '2019-02-24', '2019-02-25',
               '2019-02-26', '2019-02-27', '2019-02-28', '2019-03-01'],
              dtype='datetime64[ns]', freq='D')

### to concatenate all the column values into a single string
https://stackoverflow.com/questions/39291499/how-to-concatenate-multiple-column-values-into-a-single-column-in-panda-datafram

### To accept the future behavior, pass 'sort=False'.To retain the current behavior and silence the warning, pass 'sort=True'.

In [ ]:
TODO

### https://stackoverflow.com/questions/18548370/pandas-can-only-compare-identically-labeled-dataframe-objects-error

In [ ]:
# can only concat with index 
# https://stackoverflow.com/questions/18548370/pandas-can-only-compare-identically-labeled-dataframe-objects-error

In [ ]:
df['ETL_CRC'] = df.apply(lambda row: crc32(''.join(row.values.astype(str))), axis=1)

In [3]:
df = pd.DataFrame({'id': [1, 2, 3],
                   'name': ['a', 'b', 'c'],
                    'val': [11,22,33]})
df

   id name  val
0   1    a   11
1   2    b   22
2   3    c   33

In [9]:
df_c = pd.DataFrame({'id': [1,2,3],
                   'name': ['a', 'b', 'c'],
                    'val': [11,22,33]})
df_c

   id name  val
0   1    a   11
1   2    b   22
2   3    c   33

### .sort()

In [ ]:

groupdf.sort_values('timeflag', ascending=False)

In [13]:
# df.merge(df_c, on=['name'])
datasetdf['match'] = np.where(datasetdf.crc == cacheddf.crc, True, False)


# pd.merge(df,df_c,how='outer',indicator=True, on=df.columns)#.query('_merge=="both"').drop("_merge", axis=1)

ValueError: The truth value of an array with more than one element is ambiguous. Use a.any() or a.all()

In [10]:
# df.merge(df_c, on=['name'])
pd.merge(df,df_c,how='outer',indicator=True, on=['id']).query('_merge=="both"').drop("_merge", axis=1)

   id name_x  val_x name_y  val_y
0   1      a     11      a     11
1   2      b     22      b     22
2   3      c     33      c     33

In [14]:
df.merge(df_c, how='left', on=['name'])

   id name  id_c
0   1    a   4.0
1   1    a   1.0
2   2    b   NaN
3   3    c   NaN

###### 2018-08-23

In [23]:
df[(df.id==2) & (df.name=='b')]

   id name
1   2    b

In [27]:
df['amount']=1.1
df
dfc=df
dfc.loc[0, 'amount'] = 1.2
dfc
df.merge(dfc, how='left', on=['name', 'amount'])

   id_x name  amount  id_y
0     1    a     1.2     1
1     2    b     1.1     2
2     3    c     1.1     3

In [34]:
dfc = df.iloc[0]
# dfc = pd.DateFrame(list(dfc.values))

AttributeError: 'module' object has no attribute 'DateFrame'

In [60]:
dfa = df[["name"]]
dfa
# df.append(dfa, axis=0)

   id name  amount name
0   1    a     1.2    a
1   2    b     1.1    b
2   3    c     1.1    c

# df to tuple

In [ ]:
list(data_set.itertuples(index=False))

In [35]:
tuples = [tuple(row) for row in df_data.values]

Timestamp('2019-02-28 00:00:00')

In [ ]:

    [tuple(x) for x in df.values]
    df.to_records(index=False).tolist()
    list(map(tuple,df.values))
    list(map(tuple, df.itertuples(index=False)))

# groupby

###

In [6]:
import numpy as np
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                     'D': np.random.randn(8)})

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

In [7]:
df2 = df.set_index(['A','B'])

In [8]:
df2.groupby(level=df2.index.names.difference(['B']))

AttributeError: 'FrozenList' object has no attribute 'difference'

In [9]:
df3 = pd.DataFrame({'X': ['A', 'B', 'A', 'B'], 'Y': [1, 4, 3, 2]})

In [10]:
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [12]:
df3.groupby(['X']).get_group('B')

   X  Y
1  B  4
3  B  2

In [ ]:
# You may however pass sort=False for potential speedups:

In [14]:
df3.groupby(['X'], sort=False).sum()

   Y
X
A  4
B  6

In [15]:
df3.groupby(['X']).groups

{'A': Int64Index([0, 2], dtype='int64'),
 'B': Int64Index([1, 3], dtype='int64')}

In [16]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [75]:
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

In [76]:
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [77]:
np.random.randn(8)

array([ 0.34478688,  0.66805728,  0.0033138 ,  0.2375164 ,  1.18229755,
        0.46433911, -0.09603356, -1.43589742])

In [78]:
df = pd.DataFrame({'value':np.random.randn(8)}, 
                  index=index)

In [79]:
df

                 value
first second
bar   one     0.385253
      two     1.148538
baz   one     0.787232
      two    -0.584459
foo   one     0.618034
      two     0.263140
qux   one     0.214194
      two     0.952450

In [81]:
df.groupby(level=(0,1)).transform(lambda x:x.fillna(x.mean()))

                 value
first second
bar   one     0.385253
      two     1.148538
baz   one     0.787232
      two    -0.584459
foo   one     0.618034
      two     0.263140
qux   one     0.214194
      two     0.952450

In [19]:
s = pd.Series(np.random.randn(8), index=index)

In [28]:
s

first  second
bar    one      -1.278030
       two      -0.448272
baz    one       1.389932
       two       0.587513
foo    one      -0.656793
       two      -0.329890
qux    one      -0.040876
       two      -1.995661
dtype: float64

In [20]:
grouped= s.groupby(level=0)

In [21]:
grouped.sum()

first
bar   -1.726301
baz    1.977445
foo   -0.986682
qux   -2.036537
dtype: float64

In [23]:
s.groupby(level='second').sum()

second
one   -0.585767
two   -2.186309
dtype: float64

### aggregation

In [24]:
s.groupby(level=0).aggregate(np.sum)

first
bar   -1.726301
baz    1.977445
foo   -0.986682
qux   -2.036537
dtype: float64

In [29]:
s.groupby(level=0).describe()

,count,mean,std,min,25%,50%,75%,max
first,,,,,,,,
bar,2.0,-0.863151,0.586728,-1.278030,-1.070590,-0.863151,-0.655711,-0.448272
baz,2.0,0.988722,0.567396,0.587513,0.788118,0.988722,1.189327,1.389932
foo,2.0,-0.493341,0.231155,-0.656793,-0.575067,-0.493341,-0.411615,-0.329890
qux,2.0,-1.018268,1.382241,-1.995661,-1.506965,-1.018268,-0.529572,-0.040876

### transform

### to replace missing data with the group mean.//

In [82]:
value = np.random.randint(0,100, 1000)

In [83]:
# value

In [84]:
index = np.array(['a','b','c','d'])

In [85]:
key = index[np.random.randint(0,4, 1000)]

In [86]:
df = pd.DataFrame({'A':value},
                 index=key,
                 )

In [44]:
# df
df.groupby(level=0).count()

     A
a  253
b  254
c  257
d  236

In [49]:
df.iloc[0] = np.nan

In [50]:
df.head()

      A
b   NaN
a  46.0
a  11.0
b   5.0
d  64.0

In [52]:
df.groupby(level=0).transform(lambda x:x.fillna(x.mean())).info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, b to d
Data columns (total 1 columns):
A    1000 non-null float64
dtypes: float64(1)
memory usage: 15.6+ KB

In [92]:
df.groupby(level=0).transform(lambda x:x.count())

      A
b   245
d   252
a   250
c   253
a   250
c   253
b   245
a   250
c   253
a   250
a   250
c   253
d   252
c   253
c   253
a   250
a   250
c   253
c   253
d   252
b   245
c   253
a   250
b   245
d   252
d   252
d   252
d   252
d   252
d   252
..  ...
d   252
d   252
d   252
c   253
d   252
c   253
a   250
b   245
c   253
d   252
c   253
c   253
c   253
b   245
d   252
a   250
d   252
b   245
d   252
b   245
d   252
a   250
d   252
a   250
c   253
a   250
b   245
d   252
a   250
c   253

[1000 rows x 1 columns]

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, b to d
Data columns (total 1 columns):
A    999 non-null float64
dtypes: float64(1)
memory usage: 15.6+ KB

### rolling ???

In [53]:
df.groupby('A').rolling(4).mean()

           A
A
0.0  b   NaN
     c   NaN
     c   NaN
     d   0.0
     b   0.0
     d   0.0
     b   0.0
     b   0.0
     c   0.0
1.0  b   NaN
     b   NaN
     d   NaN
     a   1.0
     a   1.0
     a   1.0
     d   1.0
     c   1.0
     b   1.0
2.0  b   NaN
     d   NaN
     a   NaN
     d   2.0
     d   2.0
     c   2.0
     c   2.0
     d   2.0
     a   2.0
     b   2.0
     c   2.0
     d   2.0
...      ...
96.0 b  96.0
     a  96.0
     a  96.0
97.0 c   NaN
     b   NaN
     c   NaN
     b  97.0
     c  97.0
     b  97.0
     c  97.0
     b  97.0
     c  97.0
     b  97.0
98.0 d   NaN
     a   NaN
     c   NaN
     d  98.0
     b  98.0
     d  98.0
     b  98.0
     c  98.0
     c  98.0
99.0 a   NaN
     b   NaN
     c   NaN
     d  99.0
     b  99.0
     d  99.0
     c  99.0
     d  99.0

[999 rows x 1 columns]

### expanding

In [57]:
dff = df.groupby(level=0).transform(lambda x: x.fillna(x.mean()))

In [64]:
# dff
dff = dff[0:10]
dff

              A
a a   46.000000
  a   57.000000
  a  133.000000
  a  225.000000
b b   49.312253
  b   54.312253
  b   66.312253
c c   22.000000
d d   64.000000
  d   95.000000

In [66]:
dff

           A
b  49.312253
a  46.000000
a  11.000000
b   5.000000
d  64.000000
a  76.000000
d  31.000000
a  92.000000
c  22.000000
b  12.000000

In [65]:
dff.groupby(level=0).expanding().sum()

              A
a a   46.000000
  a   57.000000
  a  133.000000
  a  225.000000
b b   49.312253
  b   54.312253
  b   66.312253
c c   22.000000
d d   64.000000
  d   95.000000

### reseample, ffill()

In [67]:
df_re = pd.DataFrame({'date': pd.date_range(start='2016-01-01', periods=4,
                                            freq='W'),
                       'group': [1, 1, 2, 2],
                     'val': [5, 6, 7, 8]}).set_index('date')

In [68]:
df_re

            group  val
date
2016-01-03      1    5
2016-01-10      1    6
2016-01-17      2    7
2016-01-24      2    8

In [71]:
#  to get a daily frequency in each group of your dataframe and wish to complete the missing values with the ffill() method.

In [69]:
df_re.groupby('group').resample('1D').ffill()

                  group  val
group date
1     2016-01-03      1    5
      2016-01-04      1    5
      2016-01-05      1    5
      2016-01-06      1    5
      2016-01-07      1    5
      2016-01-08      1    5
      2016-01-09      1    5
      2016-01-10      1    6
2     2016-01-17      2    7
      2016-01-18      2    7
      2016-01-19      2    7
      2016-01-20      2    7
      2016-01-21      2    7
      2016-01-22      2    7
      2016-01-23      2    7
      2016-01-24      2    8

### Filtration

### TODO

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("drugsale_test_data.csv")

uniquekeys = ['PMD_YEAR', 'PMD_QUARTER', 'PMD_CITY', 'PMD_MEDICINALINFORMATIONID', 'PMD_COMPANYID',
             'PMD_MEDICINALSALENUMBER']

In [3]:
data.head()

,ID,PMD_YEAR,PMD_QUARTER,PMD_CITY,PMD_MEDICINALSALEMONEY,PMD_MEDICINALSALENUMBER,PMD_MEDICINALNAME,PMD_COMPANYNAME,PMD_COMPANYID,PMD_MEDICINALINFORMATIONID,...,PMD_USEMETHOD,ETL_CRC,QA_RULE_CHK_FLG,QA_MANUAL_FLG,QA_ACTIVE_FLG,CREATE_BY,CREATE_TIME,UPDATE_BY,UPDATE_TIME,TMSTAMP
0,251401,2013,1,,750711.0000,328700.0,,,M3078,D0047870410AAA1303T010,...,,768914384,NaN,NaN,True,ETL,2018-11-01 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
1,251417,2013,1,,55440.0000,48960.0,,,M3758,D0031030200AAA0102T024,...,,3631507639,NaN,NaN,True,ETL,2018-11-01 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
2,2158330,2013,1,,72513.2415,5843.0,,,M4260,D0036600200DAA0102T131,...,,1796643922,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
3,2158331,2013,1,,761737.0410,22656.0,,,M0489,D0040550100DAA1274T020,...,,3480623486,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
4,2158332,2013,1,,2704.2472,158.0,,,M1316,D0049040100CAA0237T012,...,,1337064295,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN

### count()uniquekeysuniquekeysDateFramedf[a,b,c,d,e], uniquekeys=[a,b,c], count()[d,e] [a,b,c]info()[d,e]countdf

In [50]:
data.groupby(uniquekeys).count().info()#.reset_index()

### as_index=False

In [6]:
data.groupby(uniquekeys, as_index=False).apply(mean)

NameError: name 'mean' is not defined

In [4]:
data.groupby(uniquekeys, as_index=False).count().info()#.reset_index()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 73054 entries, 0 to 73053
Data columns (total 37 columns):
PMD_YEAR                      73054 non-null int64
PMD_QUARTER                   73054 non-null int64
PMD_CITY                      73054 non-null object
PMD_MEDICINALINFORMATIONID    73054 non-null object
PMD_COMPANYID                 73054 non-null object
PMD_MEDICINALSALENUMBER       73054 non-null float64
ID                            73054 non-null int64
PMD_MEDICINALSALEMONEY        73054 non-null int64
PMD_MEDICINALNAME             73054 non-null int64
PMD_COMPANYNAME               73054 non-null int64
PMD_MEDICINALID               73054 non-null int64
PMD_ID                        73054 non-null int64
PMD_REMARK1                   73054 non-null int64
PMD_REMARK2                   73054 non-null int64
PMD_REMARK3                   73054 non-null int64
PMD_REMARK4                   73054 non-null int64
PMD_REMARK5                   73054 non-null int64
CREATE_DATE                   73054 non-null int64
CREATE_USER                   73054 non-null int64
UPDATE_DATE                   73054 non-null int64
UPDATE_USER                   73054 non-null int64
VERSION                       73054 non-null int64
STATUS                        73054 non-null int64
PMD_DATABASE                  73054 non-null int64
PMD_CLASS                     73054 non-null int64
PMD_DOSFORM                   73054 non-null int64
PMD_SPECIFICIAL               73054 non-null int64
PMD_USEMETHOD                 73054 non-null int64
ETL_CRC                       73054 non-null int64
QA_RULE_CHK_FLG               73054 non-null int64
QA_MANUAL_FLG                 73054 non-null int64
QA_ACTIVE_FLG                 73054 non-null int64
CREATE_BY                     73054 non-null int64
CREATE_TIME                   73054 non-null int64
UPDATE_BY                     73054 non-null int64
UPDATE_TIME                   73054 non-null int64
TMSTAMP                       73054 non-null int64
dtypes: float64(1), int64(33), object(3)
memory usage: 21.2+ MB

### reset_index()

In [51]:
data.groupby(uniquekeys).count().reset_index()

### size()uniquekeys, 'counts' DateFrame, Seriesreset_indexDateFrame

In [52]:
# data.groupby(uniquekeys).size()

### reset_index()size()'counts'DateFrame, group

In [7]:
df=data[["PMD_MEDICINALSALENUMBER",'PMD_COMPANYID']]

In [13]:
def date_range(df):
    tmp = pd.DataFrame([[min(df['PMD_MEDICINALSALENUMBER']), max(df['PMD_MEDICINALSALENUMBER'])]],columns=['min','max'])
    
    return tmp

In [14]:
df.groupby('PMD_COMPANYID').apply(date_range)

                     min        max
PMD_COMPANYID
M0002         0      5.0     3432.0
M0008         0      2.0      195.0
M0009         0   6720.0    16992.0
M0011         0  60060.0   173968.0
M0013         0     10.0   168000.0
M0016         0     13.0      496.0
M0020         0    -54.0     8887.0
M0029         0    160.0     3580.0
M0034         0     12.0       12.0
M0037         0   2000.0    33500.0
M0044         0   2500.0   332300.0
M0046         0    200.0     9575.0
M0047         0   1000.0   474100.0
M0049         0    150.0    17958.0
M0052         0    250.0    73250.0
M0053         0     40.0      600.0
M0069         0     25.0    23375.0
M0074         0    200.0     4480.0
M0083         0  14235.0   245715.0
M0084         0   7460.0   557480.0
M0089         0    -20.0     8545.0
M0098         0     12.0     4416.0
M0101         0    720.0    15264.0
M0113         0    300.0   111500.0
M0116         0     15.0     6625.0
M0117         0     70.0     3223.0
M0119         0     80.0       80.0
M0124         0   3600.0   653820.0
M0126         0   1400.0   112350.0
M0136         0    100.0     5100.0
...                  ...        ...
M5416         0     90.0      722.0
M5419         0    230.0     9000.0
M5420         0   -115.0     1800.0
M5423         0     -9.0    15000.0
M5424         0   2340.0   148584.0
M5426         0      1.0    22280.0
M5428         0    185.0    48161.0
M5429         0      0.0    35990.0
M5434         0     44.0     1311.0
M5436         0    541.0     6470.0
M5438         0    300.0   473760.0
M5440         0  -3600.0   100982.0
M5442         0    -10.0   206100.0
M5448         0    100.0   206400.0
M5450         0     20.0  1612260.0
M5451         0   -800.0  1982400.0
M6854         0    351.0    69874.0
M7452         0    112.0      280.0
M7453         0    -15.0    44844.0
M7456         0   -420.0   874800.0
M7457         0     30.0    23663.0
M7459         0    100.0     5100.0
M7460         0     50.0    70890.0
M7462         0    158.0    21903.0
M7463         0    800.0   194500.0
M7465         0     70.0     3223.0
M7470         0   4086.0     4086.0
M7480         0    144.0     3390.0
M7481         0     20.0      130.0
M7506         0    221.0    21140.0

[2790 rows x 2 columns]

In [53]:
data.groupby(uniquekeys).size().reset_index(name='counts')

,PMD_YEAR,PMD_QUARTER,PMD_CITY,PMD_MEDICINALINFORMATIONID,PMD_COMPANYID,PMD_MEDICINALSALENUMBER,counts
0,2013,1,,D0000100100LCD0131T001,M1359,120.0,3
1,2013,1,,D0000120100LCD0045T001,M2630,4322.0,3
2,2013,1,,D0000120100LCD0045T001,M2793,726.0,3
3,2013,1,,D0000160100CAA0141T015,M0083,67470.0,3
4,2013,1,,D0000180100LCB0195T001,M0838,4745.0,3
5,2013,1,,D0000210300AAA0497T010,M4828,520.0,3
6,2013,1,,D0000240100GBA0322T001,M3835,400.0,3
7,2013,1,,D0000240100GBA0832T001,M0828,800.0,3
8,2013,1,,D0000240100GBA0832T001,M2382,5017.0,3
9,2013,1,,D0000240100GBA0832T001,M3835,510.0,3
10,2013,1,,D0000240100GBA0832T001,M5354,200.0,3
11,2013,1,,D0000250100BAA0163T010,M2651,-230.0,3
12,2013,1,,D0000250100BAA0163T014,M4187,4200.0,3
13,2013,1,,D0000250100BAA0163T014,M4793,191506.0,3
14,2013,1,,D0000250200AAA0163T007,M3571,26460.0,3
15,2013,1,,D0000250200AAA0163T014,M0857,37800.0,3
16,2013,1,,D0000250200AAA0163T014,M0946,196840.0,3
17,2013,1,,D0000250200AAA0163T014,M2988,9520.0,3
18,2013,1,,D0000250200AAA0163T014,M3571,59262.0,3
19,2013,1,,D0000250200AAA0163T014,M4058,10416.0,3
20,2013,1,,D0000280300AAA0010T010,M0794,252300.0,3
21,2013,1,,D0000280300AAA0011T010,M0794,125900.0,3
22,2013,1,,D0000280400BAA0010T010,M5361,164000.0,3
23,2013,1,,D0000280400BAA0010T020,M2595,709400.0,3
24,2013,1,,D0000280400BAA0010T020,M2925,652640.0,3
25,2013,1,,D0000280400BAA0010T020,M3559,12000.0,3
26,2013,1,,D0000280400BAA0010T020,M5361,709400.0,1
27,2013,1,,D0000280400BAA0010T038,M3023,116800.0,3
28,2013,1,,D0000280400BAA0011T020,M3559,11600.0,3
29,2013,1,,D0000280400BAA0456T010,M5361,2000.0,3
...,...,...,...,...,...,...,...
73024,2013,1,,D0089930100LCA0417T001,M3177,6571.0,3
73025,2013,1,,D0089930100LCA0417T001,M3592,25790.0,3
73026,2013,1,,D0089930100LCA0417T001,M3703,4000.0,3
73027,2013,1,,D0089930100LCA0417T001,M3920,5400.0,3
73028,2013,1,,D0089930100LCA0739T001,M2032,16380.0,3
73029,2013,1,,D0089930100LCA1156T001,M1492,9000.0,3
73030,2013,1,,D0089930100LCA1156T001,M1989,9100.0,3
73031,2013,1,,D0089930100LCA1156T001,M3177,4199.0,3
73032,2013,1,,D0089930100LCA1156T001,M3703,200.0,3
73033,2013,1,,D0091220100AAA1590T001,M0334,1800.0,3
73034,2013,1,,D0092060138LCA0443T001,M0946,226.0,3
73035,2013,1,,D0092060138LCA0759T001,M4568,5.0,3
73036,2013,1,,D0098860100AAA0558T007,M0175,115535.0,3
73037,2013,1,,D0098860100AAA1043T007,M0175,2030.0,3
73038,2013,1,,D0098860200LCA1043T001,M0175,27360.0,3
73039,2013,1,,D0099890300KBB0789T001,M0977,103.0,3
73040,2013,1,,D0099890300KBB1195T001,M0977,20.0,3
73041,2013,1,,D0109940100AAA0812T082,M3888,2000.0,3
73042,2013,1,,D0110070600LCB0089T001,M2659,6400.0,3
73043,2013,1,,D0110070600LCB0089T001,M4238,2200.0,3
73044,2013,1,,D0110140100LCB0178T001,M0826,2600.0,3
73045,2013,1,,D0110150400KAA0654T003,M2378,4776.0,3
73046,2013,1,,D0110160200VBB1341T001,M0184,6320.0,3
73047,2013,1,,D0110160200VBB1341T001,M2988,1400.0,3
73048,2013,1,,D0110160300VBA0786T001,M0184,5137.0,3
73049,2013,1,,D0110160300VBA0992T001,M2988,610.0,3
73050,2013,1,,D0110340100LCA0628T001,M2281,5328.0,3
73051,2013,1,,D0110890100AAA0879T024,M2896,33600.0,3
73052,2013,1,,D0112220100LCB1188T001,M1002,2943.0,3
73053,2013,1,,D0113210100BAA0163T030,M4862,139800.0,3

### size()to_frame()DateFrame, 'counts', info()uniquekeysDataFramereset_index()

data.groupby(uniquekeys).size().to_frame(name='counts').info()#.reset_index()

In [56]:
# data.groupby(uniquekeys).size().to_frame(name='counts').reset_index()

### groupbygroupDataFrame, apply DataFrame",".join(x["PMD_COMPANYID"])groupPMD_COMPANYID

In [9]:
data.head(1)

,ID,PMD_YEAR,PMD_QUARTER,PMD_CITY,PMD_MEDICINALSALEMONEY,PMD_MEDICINALSALENUMBER,PMD_MEDICINALNAME,PMD_COMPANYNAME,PMD_COMPANYID,PMD_MEDICINALINFORMATIONID,...,PMD_USEMETHOD,ETL_CRC,QA_RULE_CHK_FLG,QA_MANUAL_FLG,QA_ACTIVE_FLG,CREATE_BY,CREATE_TIME,UPDATE_BY,UPDATE_TIME,TMSTAMP
0,251401,2013,1,,750711.0,328700.0,,,M3078,D0047870410AAA1303T010,...,,768914384,NaN,NaN,True,ETL,2018-11-01 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN

In [18]:
# as_index=False  apply 
df=data[["PMD_CITY", "PMD_COMPANYID", "PMD_MEDICINALINFORMATIONID"]].groupby(["PMD_CITY","PMD_MEDICINALINFORMATIONID"],as_index=False).apply(lambda x: ",".join(x["PMD_COMPANYID"]))

In [19]:
df

PMD_CITY  PMD_MEDICINALINFORMATIONID
        D0000100100LCD0131T001                                        M1359,M1359,M1359
          D0000120100LCD0045T001                      M2793,M2630,M2793,M2630,M2793,M2630
          D0000160100CAA0141T015                                        M0083,M0083,M0083
          D0000180100LCB0195T001                                        M0838,M0838,M0838
          D0000210300AAA0497T010                                        M4828,M4828,M4828
          D0000240100GBA0322T001                                        M3835,M3835,M3835
          D0000240100GBA0832T001        M5354,M2382,M3835,M0828,M2382,M5354,M3835,M082...
          D0000250100BAA0163T010                                        M2651,M2651,M2651
          D0000250100BAA0163T014                      M4187,M4793,M4187,M4793,M4187,M4793
          D0000250200AAA0163T007                                        M3571,M3571,M3571
          D0000250200AAA0163T014        M0857,M0946,M2988,M3571,M4058,M0857,M0946,M298...
          D0000280300AAA0010T010                                        M0794,M0794,M0794
          D0000280300AAA0011T010                                        M0794,M0794,M0794
          D0000280400BAA0010T010                                        M5361,M5361,M5361
          D0000280400BAA0010T020        M5361,M2925,M3559,M2595,M2925,M3559,M2595,M292...
          D0000280400BAA0010T038                                        M3023,M3023,M3023
          D0000280400BAA0011T020                                        M3559,M3559,M3559
          D0000280400BAA0456T010                                        M5361,M5361,M5361
          D0000310338AAA0163T010                                        M3092,M3092,M3092
          D0000310538AAA0483T030                                        M2752,M2752,M2752
          D0000330100AAA0684T014                                        M3714,M3714,M3714
          D0000360100LCB0765T001                      M4058,M4073,M4058,M4073,M4058,M4073
          D0000510100BAA1207T030                                        M5090,M5090,M5090
          D0000510200AAA1207T030                      M0334,M1594,M0334,M1594,M0334,M1594
          D0000530300AAA0163T010                                        M0756,M0756,M0756
          D0000530300AAA1303T010                                        M0756,M0756,M0756
          D0000530300AAA1303T014                                        M3594,M3594,M3594
          D0000530300AAA1303T020                                        M0656,M0656,M0656
          D0000560200AAA0163T006                                        M3744,M3744,M3744
          D0000560200AAA1439T001        M1501,M3744,M2811,M1501,M3744,M2811,M1501,M374...
                                                              ...
        D0089280100BBA0628T010                                        M4313,M4313,M4313
          D0089460100KAB0243T001                                        M4290,M4290,M4290
          D0089550200LCB1048T001                                        M0456,M0456,M0456
          D0089710138BAA0523T010                                        M4699,M4699,M4699
          D0089710238AAA0523T014                                        M2599,M2599,M2599
          D0089710338BAA0523T010                      M0273,M2305,M0273,M2305,M0273,M2305
          D0089900100LCA0558T001                                        M3589,M3589,M3589
          D0089930100LCA0059T001                      M1492,M3592,M1492,M3592,M1492,M3592
          D0089930100LCA0417T001        M3177,M3920,M1989,M3592,M3703,M3177,M3920,M198...
          D0089930100LCA0739T001                                        M2032,M2032,M2032
          D0089930100LCA1156T001        M1492,M3177,M1989,M3703,M1492,M3177,M1989,M370...
          D0091220100AAA1590T001                                        M0334,M0334,M0334
          D0092060138LCA0443T001                                        M0946,M0946,M0946
          D0092060138LCA0759T001                                        M4568,M4568,M4568
          D0098860100AAA0558T007                                        M0175,M0175,M0175
          D0098860100AAA1043T007                                        M0175,M0175,M0175
          D0098860200LCA1043T001                                        M0175,M0175,M0175
          D0099890300KBB0789T001                                        M0977,M0977,M0977
          D0099890300KBB1195T001                                        M0977,M0977,M0977
          D0109940100AAA0812T082                                        M3888,M3888,M3888
          D0110070600LCB0089T001                      M2659,M4238,M2659,M4238,M2659,M4238
          D0110140100LCB0178T001                                        M0826,M0826,M0826
          D0110150400KAA0654T003                                        M2378,M2378,M2378
          D0110160200VBB1341T001                      M2988,M0184,M2988,M0184,M2988,M0184
          D0110160300VBA0786T001                                        M0184,M0184,M0184
          D0110160300VBA0992T001                                        M2988,M2988,M2988
          D0110340100LCA0628T001                                        M2281,M2281,M2281
          D0110890100AAA0879T024                                        M2896,M2896,M2896
          D0112220100LCB1188T001                                        M1002,M1002,M1002
          D0113210100BAA0163T030                                        M4862,M4862,M4862
Length: 54453, dtype: object

In [17]:

dfd = df.reset_index()
# dfd.drop([0,1], axis=1)
dfd.drop(["PMD_CITY", "PMD_MEDICINALINFORMATIONID"], axis=1)

ValueError: labels [1] not contained in axis

In [7]:
data[["PMD_CITY", "PMD_COMPANYID"]].groupby(["PMD_CITY", ]).apply(lambda x: ",".join(x["PMD_COMPANYID"]))

PMD_CITY
      M3078,M3758,M1574,M1574,M3078,M0551,M0551,M188...
      M3078,M3758,M1574,M3078,M0551,M0551,M0795,M298...
     M4260,M0489,M1316,M0489,M5411,M1311,M1341,M048...
      M4489,M3078,M1574,M3078,M0551,M0795,M5361,M486...
     M3003,M1020,M3334,M5428,M2386,M4393,M5313,M150...
     M2903,M3606,M3641,M4310,M4310,M5354,M2106,M210...
    M3238,M3345,M3276,M5317,M2716,M0799,M0832,M484...
      M3078,M3758,M1574,M3078,M0551,M2986,M5361,M279...
      M3078,M3758,M3758,M1574,M1574,M1730,M2332,M233...
     M1352,M4848,M0970,M4731,M1820,M4628,M2489,M227...
      M3078,M3758,M1574,M3078,M0551,M0551,M5361,M486...
     M2356,M4573,M3251,M3339,M2475,M2277,M2550,M087...
      M3078,M3758,M3758,M1574,M3078,M0551,M0551,M079...
      M0175,M4768,M4768,M4768,M4768,M4768,M4990,M545...
      M3078,M1574,M3018,M3078,M0795,M5361,M2792,M486...
     M2252,M0728,M4500,M2555,M3212,M4088,M5212,M335...
      M3078,M3758,M1574,M3078,M0551,M0795,M2986,M536...
     M3078,M3758,M1574,M3078,M0551,M2986,M5361,M486...
      M3078,M1574,M1574,M2332,M3078,M0795,M4441,M536...
     M2022,M1324,M3793,M1316,M1233,M4193,M4135,M232...
      M3078,M1574,M3078,M0551,M0795,M2986,M5361,M486...
     M2901,M1963,M5357,M3175,M5267,M1059,M3366,M160...
      M4214,M2377,M0202,M0240,M2377,M2126,M2969,M499...
     M5434,M4260,M1723,M2464,M3958,M4260,M2515,M037...
      M2353,M3078,M3306,M0551,M0551,M5361,M0528,M486...
dtype: object

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("drugsale_test_data.csv")

In [45]:
data.head()

,ID,PMD_YEAR,PMD_QUARTER,PMD_CITY,PMD_MEDICINALSALEMONEY,PMD_MEDICINALSALENUMBER,PMD_MEDICINALNAME,PMD_COMPANYNAME,PMD_COMPANYID,PMD_MEDICINALINFORMATIONID,...,PMD_USEMETHOD,ETL_CRC,QA_RULE_CHK_FLG,QA_MANUAL_FLG,QA_ACTIVE_FLG,CREATE_BY,CREATE_TIME,UPDATE_BY,UPDATE_TIME,TMSTAMP
0,251401,2013,1,,750711.0000,328700.0,,,M3078,D0047870410AAA1303T010,...,,768914384,NaN,NaN,True,ETL,2018-11-01 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
1,251417,2013,1,,55440.0000,48960.0,,,M3758,D0031030200AAA0102T024,...,,3631507639,NaN,NaN,True,ETL,2018-11-01 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
2,2158330,2013,1,,72513.2415,5843.0,,,M4260,D0036600200DAA0102T131,...,,1796643922,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
3,2158331,2013,1,,761737.0410,22656.0,,,M0489,D0040550100DAA1274T020,...,,3480623486,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
4,2158332,2013,1,,2704.2472,158.0,,,M1316,D0049040100CAA0237T012,...,,1337064295,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN

[251401 2013 1 '\xe5\x8c\x97\xe4\xba\xac' 750711.0 328700.0
 '\xe8\x8e\xab\xe6\xb2\x99\xe5\xbf\x85\xe5\x88\xa9'
 '\xe6\x97\xa5\xe6\x9c\xac\xe4\xbd\x8f\xe5\x8f\x8b\xe5\x88\xb6\xe8\x8d\xaf'
 'M3078' 'D0047870410AAA1303T010' 'HA03FA-D004787' nan 10 nan nan nan nan
 nan nan nan nan nan nan 1 1 '\xe7\x89\x87\xe5\x89\x82' '5mg'
 '\xe5\x86\x85\xe6\x9c\x8d' 768914384 nan nan True 'ETL'
 '2018-11-01 20:49:59.333' 'ETL' '2018-11-01 20:49:59.333' nan]
('1', '2')

### https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

In [47]:
import dateutil

# Load data from csv file
# data = pd.DataFrame.from_csv('phone_data.csv')
# Convert date from string to date times
data['CREATE_TIME'] = data['CREATE_TIME'].apply(dateutil.parser.parse, dayfirst=True)
data.head()

,ID,PMD_YEAR,PMD_QUARTER,PMD_CITY,PMD_MEDICINALSALEMONEY,PMD_MEDICINALSALENUMBER,PMD_MEDICINALNAME,PMD_COMPANYNAME,PMD_COMPANYID,PMD_MEDICINALINFORMATIONID,...,PMD_USEMETHOD,ETL_CRC,QA_RULE_CHK_FLG,QA_MANUAL_FLG,QA_ACTIVE_FLG,CREATE_BY,CREATE_TIME,UPDATE_BY,UPDATE_TIME,TMSTAMP
0,251401,2013,1,,750711.0000,328700.0,,,M3078,D0047870410AAA1303T010,...,,768914384,NaN,NaN,True,ETL,2018-01-11 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
1,251417,2013,1,,55440.0000,48960.0,,,M3758,D0031030200AAA0102T024,...,,3631507639,NaN,NaN,True,ETL,2018-01-11 20:49:59.333,ETL,2018-11-01 20:49:59.333,NaN
2,2158330,2013,1,,72513.2415,5843.0,,,M4260,D0036600200DAA0102T131,...,,1796643922,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
3,2158331,2013,1,,761737.0410,22656.0,,,M0489,D0040550100DAA1274T020,...,,3480623486,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN
4,2158332,2013,1,,2704.2472,158.0,,,M1316,D0049040100CAA0237T012,...,,1337064295,NaN,NaN,True,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,talend_load@SHN1708DSL9YF2,2019-02-28 11:31:44.000,NaN

In [19]:
data.head()
# str(data.values)

"[[251401L 2013L 1L ... 'ETL' '2018-11-01 20:49:59.333' nan]\n [251417L 2013L 1L ... 'ETL' '2018-11-01 20:49:59.333' nan]\n [2158330L 2013L 1L ... 'talend_load@SHN1708DSL9YF2'\n  '2019-02-28 11:31:44.000' nan]\n ...\n [2532104L 2013L 1L ... 'talend_load@SHN1708DSL9YF2'\n  '2019-02-28 13:58:22' nan]\n [2532105L 2013L 1L ... 'talend_load@SHN1708DSL9YF2'\n  '2019-02-28 13:58:22' nan]\n [2532106L 2013L 1L ... 'talend_load@SHN1708DSL9YF2'\n  '2019-02-28 13:58:22' nan]]"

In [48]:
# groupby
data["PMD_CITY"].value_counts()

      17896
      14012
      13284
      13062
      12302
      12229
      11906
      11796
      11678
      10407
       9599
      9597
       9401
      9019
       8796
       8698
      5613
      4410
      4356
      4224
      3642
      3282
      2562
      2457
     2199
Name: PMD_CITY, dtype: int64

In [49]:
data.groupby(["PMD_CITY"]).groups.keys()

['\xe5\xb9\xbf\xe5\xb7\x9e\xe5\xb8\x82',
 '\xe5\x8d\x97\xe4\xba\xac\xe5\xb8\x82',
 '\xe6\xb2\x88\xe9\x98\xb3\xe5\xb8\x82',
 '\xe5\x8c\x97\xe4\xba\xac',
 '\xe9\x87\x8d\xe5\xba\x86\xe5\xb8\x82',
 '\xe6\xad\xa6\xe6\xb1\x89',
 '\xe9\x95\xbf\xe6\xb2\x99',
 '\xe6\x88\x90\xe9\x83\xbd',
 '\xe4\xb8\x8a\xe6\xb5\xb7',
 '\xe5\x93\x88\xe5\xb0\x94\xe6\xbb\xa8\xe5\xb8\x82',
 '\xe6\x9d\xad\xe5\xb7\x9e',
 '\xe6\x88\x90\xe9\x83\xbd\xe5\xb8\x82',
 '\xe7\x9f\xb3\xe5\xae\xb6\xe5\xba\x84',
 '\xe5\xa4\xa9\xe6\xb4\xa5',
 '\xe9\x83\x91\xe5\xb7\x9e\xe5\xb8\x82',
 '\xe9\x83\x91\xe5\xb7\x9e',
 '\xe6\xb2\x88\xe9\x98\xb3',
 '\xe8\xa5\xbf\xe5\xae\x89\xe5\xb8\x82',
 '\xe5\x93\x88\xe5\xb0\x94\xe6\xbb\xa8',
 '\xe5\xb9\xbf\xe5\xb7\x9e',
 '\xe6\xb5\x8e\xe5\x8d\x97',
 '\xe8\xa5\xbf\xe5\xae\x89',
 '\xe9\x87\x8d\xe5\xba\x86',
 '\xe5\x8d\x97\xe4\xba\xac',
 '\xe5\x8c\x97\xe4\xba\xac\xe5\xb8\x82']

In [50]:
data.groupby("PMD_CITY")['PMD_MEDICINALSALEMONEY'].sum()

PMD_CITY
      9.013887e+09
      1.116227e+10
     4.453168e+09
      3.025418e+09
     1.738821e+09
     2.418503e+09
    1.858250e+09
      2.799192e+09
      8.544224e+09
     2.171378e+09
      3.161391e+09
     1.950799e+09
      5.086572e+09
      4.281739e+09
      2.120332e+09
     1.188307e+09
      2.361001e+09
     2.027361e+09
      1.249036e+09
     1.652649e+09
      3.739957e+09
     1.417676e+09
      3.337902e+09
     2.522970e+09
      3.411868e+09
Name: PMD_MEDICINALSALEMONEY, dtype: float64

In [52]:
data.groupby("PMD_CITY")['PMD_MEDICINALSALENUMBER'].count()

PMD_CITY
      13062
      14012
      4410
       9401
      3282
      9019
     2199
       8796
      17896
      4356
      12302
      3642
      10407
      11906
       9599
      2562
      11678
      9597
       8698
      2457
      13284
      5613
      12229
      4224
      11796
Name: PMD_MEDICINALSALENUMBER, dtype: int64

### Groupby output format  Series or DataFrame?

The output from a groupby and aggregation operation varies between Pandas Series and Pandas Dataframes, which can be confusing for new users. As a rule of thumb, if you calculate more than one column of results, your result will be a Dataframe. For a single column of results, the agg function, by default, will produce a Series.

In [ ]:
get_dummies

### Pandas Data Wrangling: Avoiding that 'SettingWithCopyWarning'
https://maxpowerwastaken.github.io/blog/pandas_view_vs_copy/

### Tutorial: Using Pandas with Large Data Sets in Python
https://www.dataquest.io/blog/pandas-big-data/

In [ ]:
TODO 
pandas str.

### .astype
https://pbpython.com/pandas_dtypes.html

In [2]:
import pandas as pd

In [7]:
df = pd.DataFrame([[20],['close']], columns=['units'])

In [8]:
df

   units
0     20
1  close

In [9]:
# df["Start_Date"] = pd.to_datetime(df[['Month', 'Day', 'Year']])

# I don't know why cannot astype from str to int directly, not working. 
df["units"] = pd.to_numeric(df['units'], errors='coerce')# .fillna(0)

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html

In [10]:
df

   units
0   20.0
1    NaN

In [13]:
df=df.dropna()

In [14]:
df.astype(int)

   units
0     20

In [44]:
tickers= pd.read_csv("tickers.csv", dtype={'ticker_symbol':str})

In [45]:
tickers.head()

   Unnamed: 0 ticker_symbol   list_date delist_date SEC_SHORT_NAME
0           0        000001  1991-04-03         NaN
1           1        000002  1991-01-29         NaN            A
2           2        000003  1991-07-03  2002-06-14          PTA
3           3        000004  1991-01-14         NaN
4           4        000005  1990-12-10         NaN

In [46]:
tickers.tail()

      Unnamed: 0 ticker_symbol   list_date delist_date SEC_SHORT_NAME
3745        3745        603993  2012-10-09         NaN
3746        3746        603996  2015-12-22         NaN           ST
3747        3747        603997  2015-03-02         NaN
3748        3748        603998  2014-12-05         NaN
3749        3749        603999  2015-12-10         NaN

In [47]:
ticker_list = tickers.ticker_symbol.unique().tolist()

In [48]:
len(ticker_list)

3750

In [41]:
# df = pd.read_csv("tpas.csv")
df = pd.read_csv("cdcon.csv", dtype={'ticker_symbol':str})

In [42]:
df.head()

,ticker_symbol,con_target_price,con_score,con_type_target_price,con_type_score
0,000001,16.044000,4.500000,1,1
1,000002,36.563333,6.000000,1,1
2,000012,7.200000,4.000000,2,1
3,000030,6.600000,6.000000,2,2
4,000031,8.372500,5.714286,1,1

In [39]:
df.shape

(1382, 5)

In [22]:
# df = df.set_index(['ticker_symbol']).loc[ticker_list]
# cd_con = cd_con.reset_index()

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

In [32]:
# con = df[~df.con_score.isnull()]

In [34]:
# con.head()

,ticker_symbol,con_target_price,con_score,con_type_target_price,con_type_score,con_date
0,1,16.075735,0.956055,1.0,1.0,2019-07-26
1,2,34.937118,0.956019,1.0,1.0,2019-07-26
6,8,4.500000,0.750000,2.0,2.0,2019-07-26
10,12,7.200000,0.875000,2.0,2.0,2019-07-26
12,16,NaN,0.750000,3.0,2.0,2019-07-26

In [1]:
# df.set_index(['ticker_symbol']).loc[ticker_list]  # ticker_listdfindex dfindexNAN

### Find difference between two data frames

### https://stackoverflow.com/questions/48647534/python-pandas-find-difference-between-two-data-frames

In [ ]:
pd.concat([df1,df2]).drop_duplicates(keep=False)

### https://datascience.stackexchange.com/questions/45075/how-to-compare-two-dataframes-and-put-the-counted-unique-values-in-a-first-dataf
https://stackoverflow.com/questions/20225110/comparing-two-dataframes-and-getting-the-differences

### https://datatofish.com/compare-values-dataframes/

### https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.equals.html

### https://datatofish.com/export-pandas-dataframe-json/
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_json.html

### https://stackoverflow.com/questions/32041245/fast-method-for-removing-duplicate-columns-in-pandas-dataframe

### np.where

In [ ]:
# https://www.cnblogs.com/massquantity/p/8908859.html

In [ ]:
# https://stackoverflow.com/questions/26255671/pandas-column-values-to-columns

In [ ]:
reset_index, warning

In [4]:
#                 updated_data_set[key] = dfpre[dfpre.id.isin(preids)]
style = pd.read_csv('data_morning_start_style.csv')
style.head()

   SECURITY_ID_INT       raw_X       raw_Y vertical horizontal
0             1734 -106.512730  223.595615    large      value
1             1351  -95.753155  244.328818    large      value
2             2228  -74.231371  318.054976    large      value
3             2296  -57.797931  394.503697    large      value
4             1971  -50.873616  581.970420    large      value

In [6]:
style['raw_X'][3]

-57.797930543

In [11]:
style.shape

(3089, 5)

In [12]:
df = style[:12]

In [18]:
dates = pd.date_range('2018-01-01','2019-01-01',freq='BM')
dates

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-30', '2018-04-30',
               '2018-05-31', '2018-06-29', '2018-07-31', '2018-08-31',
               '2018-09-28', '2018-10-31', '2018-11-30', '2018-12-31'],
              dtype='datetime64[ns]', freq='BM')

In [14]:
df.index=dates

In [15]:
df

            SECURITY_ID_INT       raw_X       raw_Y vertical horizontal
2018-01-31             1734 -106.512730  223.595615    large      value
2018-02-28             1351  -95.753155  244.328818    large      value
2018-03-31             2228  -74.231371  318.054976    large      value
2018-04-30             2296  -57.797931  394.503697    large      value
2018-05-31             1971  -50.873616  581.970420    large      value
2018-06-30              596  -48.216841  350.745190    large      value
2018-07-31             1768  -34.912216  264.474972    large      value
2018-08-31              599  -31.074632  369.757377    large      value
2018-09-30             1441  -27.497806  311.781603    large      value
2018-10-31            11293  -21.570914  327.138403    large      value
2018-11-30             2056  -19.671819  640.353763    large      value
2018-12-31             2196  -13.072381  496.736476    large      value

In [4]:
style[style.vertical.isin([])]

Empty DataFrame
Columns: [SECURITY_ID_INT, raw_X, raw_Y, vertical, horizontal]
Index: []

# Empty DataFrame with or without columns

In [25]:
import pandas as pd
import numpy as np

In [2]:
col='price'
col_con = pd.DataFrame(columns=[col])

In [4]:
col_con.columns

Index([u'price'], dtype='object')

In [7]:
df =pd.DataFrame([10,8,6,4,2])

In [8]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [9]:
datelist = pd.DataFrame(pd.date_range("2019-01-01", "2019-01-05"), columns=["date"])
datelist

        date
0 2019-01-01
1 2019-01-02
2 2019-01-03
3 2019-01-04
4 2019-01-05

In [10]:
datelist.columns

Index([u'date'], dtype='object')

In [11]:
# df = pd.read_csv('research-dev.csv', dtype={"STOCK_CODE": str})

In [12]:
# df.head()

,SCHEDULE_ID,STOCK_CODE,STOCK_NAME,CON_DATE,TARGET_PRICE,TARGET_PRICE_TYPE,SCORE,SCORE_TYPE,TMSTAMP,ENTRYDATE,ENTRYTIME,TDATE,DT,ETL_CRC,INSERT_TIME,UPDATE_TIME
0,20758,1,A,2010-1-4 00:00:00,24.7216,1,0.734274,1,NaN,NaN,NaN,NaN,2019-9-4 10:35:16,2733396264,2019-9-4 10:35:16,2019-9-4 10:35:16
1,20759,2,A,2010-1-4 00:00:00,14.9572,1,0.838957,1,NaN,NaN,NaN,NaN,2019-9-4 10:35:16,4171701419,2019-9-4 10:35:16,2019-9-4 10:35:16
2,20760,12,A,2010-1-4 00:00:00,20.3734,1,0.799333,1,NaN,NaN,NaN,NaN,2019-9-4 10:35:16,1552382292,2019-9-4 10:35:16,2019-9-4 10:35:16
3,20761,498,*ST,2010-1-4 00:00:00,NaN,3,0.500000,4,NaN,NaN,NaN,NaN,2019-9-4 10:35:16,396978625,2019-9-4 10:35:16,2019-9-4 10:35:16
4,20762,600200,,2010-1-4 00:00:00,3.5000,4,0.500000,4,NaN,NaN,NaN,NaN,2019-9-4 10:35:16,3181536836,2019-9-4 10:35:16,2019-9-4 10:35:16

In [14]:
# df[df.STOCK_CODE=='000001']

c:\python27\lib\site-packages\pandas\core\ops.py:816: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = getattr(x, name)(y)

TypeError: invalid type comparison

#

In [37]:
df = pd.read_csv('research-dev.csv', dtype={"STOCK_CODE": str})

In [42]:
df.head()
sdf = df[(df.STOCK_CODE=='002027') & (df.CON_DATE<'2011')]

In [43]:
sdf.head()
sdf = sdf[['STOCK_CODE','CON_DATE','TARGET_PRICE','TARGET_PRICE_TYPE']]

In [44]:
sdf.to_csv('2027.csv')

In [45]:
sdf = pd.read_csv('2027.csv')
sdf.head()

,Unnamed: 0,STOCK_CODE,CON_DATE,TARGET_PRICE,TARGET_PRICE_TYPE
0,1132,2027,2010-01-04 00:00:00,3.0,4
1,2834,2027,2010-01-07 00:00:00,3.0,4
2,4528,2027,2010-01-05 00:00:00,3.0,4
3,6236,2027,2010-01-08 00:00:00,3.0,4
4,7942,2027,2010-01-11 00:00:00,3.0,4

### : TARGET_PRICE_TYPE=4CON_DATE>'2010-1-4'TARGET_PRICE=np.nan

In [46]:
df = sdf.copy()
idx = (df.CON_DATE > '2010-01-04 00:00:00') & (df.TARGET_PRICE_TYPE == 4)
# idx = df.target_price_type == 4
df.loc[idx, 'TARGET_PRICE'] = np.nan
df.head()

,Unnamed: 0,STOCK_CODE,CON_DATE,TARGET_PRICE,TARGET_PRICE_TYPE
0,1132,2027,2010-01-04 00:00:00,3.0,4
1,2834,2027,2010-01-07 00:00:00,NaN,4
2,4528,2027,2010-01-05 00:00:00,NaN,4
3,6236,2027,2010-01-08 00:00:00,NaN,4
4,7942,2027,2010-01-11 00:00:00,NaN,4

In [48]:
apy= range(500000)

### a very easy way to check whether to ndarray has same values

In [53]:
a1 = [0,1,1,2]
a2=[0,1,2,2]
np.allclose(a1,a2)

False

In [56]:

from timeit import repeat
def perf_comp_data(func_list, data_list, rep=3, number=1):
    res_list={}
    for name in enumerate(func_list):
        stmt = name[1] + '(' + data_list[name[0]] + ')'
        setup = "from __main__ import " + name[1] + ', ' + data_list[name[0]]
        results = repeat(stmt=stmt, setup=setup, repeat = rep, number=number)
        res_list[name[1]] = sum(results) / rep
    res_sort = sorted(res_list.iteritems(), key = lambda (k,v): (v, k))
    for item in res_sort:
        rel = item[1] / res_sort[0][1]
        print('function: ' + item[0] + ', av. time sec: %9.5f, '% item[1] + 'relative: %6.1f' % rel)

In [65]:
apy= range(500000)

In [57]:
from math import *
def f(x):
    return abs(cos(x)) ** 0.5 + sin(2+3 * x)

In [58]:
def f1(a):
    res = []
    for x in a :
        res.append(f(x))
    return res

In [59]:
def f2(a):
    return [f(x) for x in a]

In [60]:
def f3(a):
    ex = 'abs(cos(x)) ** 0.5 + sin(2+3*x)'
    return [eval(ex) for x in a]

In [66]:
import numpy as np
anp = np.arange(500000)
def f4(a):
    return (np.abs(np.cos(a)) ** 0.5 + np.sin(2+3*a))

In [72]:
import numexpr as ne
def f5(a):
    ex = 'abs(cos(a)) ** 0.5 + sin(2+3*a)'
    res = []
    ne.set_num_threads(1)
    return ne.evaluate(ex)

In [73]:
import numexpr as ne
def f6(a):
    ex = 'abs(cos(a)) ** 0.5 + sin(2+3*a)'
    res = []
    ne.set_num_threads(16)
    return ne.evaluate(ex)

In [74]:
np.allclose(apy,anp)

True

In [75]:
func_list = ['f1','f2','f4','f5','f6']
data_list = ['apy','apy','anp','anp','anp']

In [76]:
perf_comp_data(func_list, data_list)

function: f6, av. time sec:   0.03455, relative:    1.0
function: f5, av. time sec:   0.07834, relative:    2.3
function: f4, av. time sec:   0.08795, relative:    2.5
function: f1, av. time sec:   0.73279, relative:   21.2
function: f2, av. time sec:   0.97141, relative:   28.1

### DataFrame.where is useful for Replacing values where the condition is False.
DataFrame.mask is used for Replacing values where the condition is True.

In [2]:
df = pd.DataFrame([1, np.nan])

In [5]:
df = df.where((pd.notnull(df)), None)

In [6]:
df

      0
0     1
1  None

In [8]:
#         df = df.replace('nan', 'None')
#         df = df.where((pd.notnull(df)), None)
df.iloc[0,0] = 'abnan'

In [9]:
df = df.where((pd.notnull(df)), None)

In [10]:
df

       0
0  abnan
1   None

In [31]:
df = pd.read_csv('cdcon.csv', dtype={"STOCK_CODE": str})

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1382 entries, 0 to 1381
Data columns (total 5 columns):
ticker_symbol            1382 non-null int64
con_target_price         740 non-null float64
con_score                1382 non-null float64
con_type_target_price    1382 non-null int64
con_type_score           1382 non-null int64
dtypes: float64(2), int64(3)
memory usage: 54.1 KB

In [20]:
df.head()

,ticker_symbol,con_target_price,con_score,con_type_target_price,con_type_score
0,1,16.044000,4.500000,1,1
1,2,36.563333,6.000000,1,1
2,12,7.200000,4.000000,2,1
3,30,6.600000,6.000000,2,2
4,31,8.372500,5.714286,1,1

In [17]:
np.where(df.con_type_target_price==1, 'A', 'B')

array(['A', 'A', 'B', ..., 'B', 'B', 'B'], dtype='|S1')

In [ ]:
# the recommended way to use np.where

In [21]:
df['con_type_target_price'] = np.where(df.con_type_target_price==1, 'A', 'B')

In [18]:
df.where(df.con_type_target_price==1, 'b')

,ticker_symbol,con_target_price,con_score,con_type_target_price,con_type_score
0,1,16.044,4.5,1,1
1,2,36.5633,6,1,1
2,b,b,b,b,b
3,b,b,b,b,b
4,31,8.3725,5.71429,1,1
5,b,b,b,b,b
6,43,15.16,7,1,1
7,b,b,b,b,b
8,b,b,b,b,b
9,b,b,b,b,b
10,63,38.4412,4.4375,1,1
11,b,b,b,b,b
12,89,10.7,3.25,1,1
13,b,b,b,b,b
14,b,b,b,b,b
15,b,b,b,b,b
16,157,6.58626,5.94118,1,1
17,333,61.8253,5.4375,1,1
18,338,15.64,5.81818,1,1
19,401,21.994,5.36364,1,1
20,b,b,b,b,b
21,b,b,b,b,b
22,b,b,b,b,b
23,425,6.18833,5.54545,1,1
24,b,b,b,b,b
25,b,b,b,b,b
26,b,b,b,b,b
27,b,b,b,b,b
28,b,b,b,b,b
29,b,b,b,b,b
...,...,...,...,...,...
1352,b,b,b,b,b
1353,b,b,b,b,b
1354,b,b,b,b,b
1355,b,b,b,b,b
1356,b,b,b,b,b
1357,b,b,b,b,b
1358,b,b,b,b,b
1359,b,b,b,b,b
1360,b,b,b,b,b
1361,b,b,b,b,b
1362,b,b,b,b,b
1363,b,b,b,b,b
1364,b,b,b,b,b
1365,b,b,b,b,b
1366,b,b,b,b,b
1367,b,b,b,b,b
1368,b,b,b,b,b
1369,b,b,b,b,b
1370,b,b,b,b,b
1371,b,b,b,b,b
1372,b,b,b,b,b
1373,b,b,b,b,b
1374,b,b,b,b,b
1375,b,b,b,b,b
1376,b,b,b,b,b
1377,b,b,b,b,b
1378,b,b,b,b,b
1379,b,b,b,b,b
1380,b,b,b,b,b
1381,b,b,b,b,b

### iterrows

In [27]:
for index, row in df.head().iterrows():
    print(index, row)
    print(type(row))

(0, ticker_symbol                 1
con_target_price         16.044
con_score                   4.5
con_type_target_price         A
con_type_score                1
Name: 0, dtype: object)
<class 'pandas.core.series.Series'>
(1, ticker_symbol                  2
con_target_price         36.5633
con_score                      6
con_type_target_price          A
con_type_score                 1
Name: 1, dtype: object)
<class 'pandas.core.series.Series'>
(2, ticker_symbol             12
con_target_price         7.2
con_score                  4
con_type_target_price      B
con_type_score             1
Name: 2, dtype: object)
<class 'pandas.core.series.Series'>
(3, ticker_symbol             30
con_target_price         6.6
con_score                  6
con_type_target_price      B
con_type_score             2
Name: 3, dtype: object)
<class 'pandas.core.series.Series'>
(4, ticker_symbol                 31
con_target_price          8.3725
con_score                5.71429
con_type_target_price          A
con_type_score                 1
Name: 4, dtype: object)
<class 'pandas.core.series.Series'>

### itertuples

In [41]:
for index, row in df.head().iterrows():
    print(index, row)
    print(type(row))

(0, A    NaN
B    2.0
C    NaN
D    0.0
Name: 0, dtype: float64)
<class 'pandas.core.series.Series'>
(1, A    3.0
B    4.0
C    NaN
D    1.0
Name: 1, dtype: float64)
<class 'pandas.core.series.Series'>
(2, A    NaN
B    NaN
C    NaN
D    5.0
Name: 2, dtype: float64)
<class 'pandas.core.series.Series'>
(3, A    NaN
B    3.0
C    NaN
D    4.0
Name: 3, dtype: float64)
<class 'pandas.core.series.Series'>

In [ ]:
df.replace()

In [44]:
df.replace(np.nan, "None")

      A     B     C  D
0  None     2  None  0
1     3     4  None  1
2  None  None  None  5
3  None     3  None  4

In [47]:
df.loc[1, 'A'] = 3.1415926

In [51]:
df.round({'A': 4, 'B': 1})

        A    B   C  D
0     NaN  2.0 NaN  0
1  3.1416  4.0 NaN  1
2     NaN  NaN NaN  5
3     NaN  3.0 NaN  4